[
  {
    "path": "posts/2022-01-09-sharpen-jupyter-notebook/",
    "title": "Sharpen Jupyter Notebook",
    "description": "An artisan must sharpen her tools before she is to do the work not only well but also blissfully. Jupyter notebook is a powerful tool to learn python coding(local machine) as well as data science, AI(colab on cloud). Python course I took from university only covered python per se which was a bit of pity.",
    "author": [
      {
        "name": "V.LC.LAKE",
        "url": {}
      }
    ],
    "date": "2022-01-09",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nWhat is Jupyter Notebook ?\r\nLife-easying commands\r\nChange root path for JN\r\nExport JN to pdf\r\nMake JN a code-free document\r\nWhy need a Cloud JN ?\r\n\r\n\r\n#TOC {\r\n  color: #7B1FA2;\r\n  font-family: Agency FB;\r\n  font-size: 20px;\r\n}\r\nbody{\r\n  color: #7B1FA2;\r\n}\r\nWhat is Jupyter Notebook ?\r\nThese are not official definition of JN, but some personal understandings which helped me in learning and working\r\nweb-based computational environment for creating notebook documents (formally ipython notebook, that’s why its extension is .ipynb. Btw, the name jupyter is said to refer to 3 languages: Ju = Julia, Pyt = Python, the 3rd is R ).\r\na notebook is a JSON document( you can see it if you use any other python editor such as Spyder to open .ipynb file).\r\nJupyter Kernel is the program handling the relevant requests and response.\r\n\r\n\r\n\r\nFigure 1: Kernel -Python 3\r\n\r\n\r\n\r\ncodes or texts are written inside Cell of which there are 2 types: Code, Markdown. If you click any cell, the type will be shown here.\r\n\r\n\r\n\r\nFigure 2: Cell Type\r\n\r\n\r\n\r\nby Python kernel, a notebook is run together with a python instance, which maintains all the variables and functions ever executed in code cells within a notebook, even after the cell is deleted.\r\n\r\ndir()\r\n\r\nnotebook will only care about the sequence of execution rather than the sequence a cell is positioned ( e.g.,insertion ).\r\nLife-easying commands\r\nChange root path for JN\r\nExport JN to pdf\r\nMake JN a code-free document\r\nWhy need a Cloud JN ?\r\n\r\n\r\n\r\n",
    "preview": "posts/2022-01-09-sharpen-jupyter-notebook/pics/kernel.png",
    "last_modified": "2022-01-09T14:06:04+08:00",
    "input_file": "sharpen-jupyter-notebook.knit.md"
  },
  {
    "path": "posts/2021-12-17-report-with-r-markdown/",
    "title": "Report with R Markdown",
    "description": "Markdown can be used in many situations, such as writing report in jupyter notebook, creating distill blog in R studio or simply generating report in html, word or pdf format. Some tips & resources are commonly used.",
    "author": [
      {
        "name": "V.LC.LAKE",
        "url": {}
      }
    ],
    "date": "2021-12-17",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nYAML Header\r\nAdd Date Manually\r\nAdd Date Automatically\r\nAdd Table-of-Content & CSS\r\nCustomize fonts and colors\r\nAdd Parameters\r\n\r\nPlots\r\nFigure arguments\r\nSet Options Globally\r\nKeep the Current Format\r\n\r\nAdd Tables\r\nCode Chunk\r\nOptions\r\nLoad Packages\r\nInteract with Python\r\n\r\n\r\nIn a R Markdown document, there are mainly 3 elements which are YAML Header, Text Body and Code Chunk.\r\nonline cheat sheet\r\nYAML Header\r\nAdd Date Manually\r\n\r\n\r\n\r\n---\r\ntitle: \"Untitled\"\r\nauthor: \"V LAKE\"\r\ndate: \"12/17/2021\"\r\noutput: html_document\r\n---\r\nAdd Date Automatically\r\n\r\n\r\n\r\n---\r\ntitle: \"Untitled\"\r\nauthor: \"V LAKE\"\r\ndate: \"2022-01-09\"\r\noutput: html_document\r\n---\r\n\r\n\r\n\r\n---\r\ntitle: \"Untitled\"\r\nauthor: \"V LAKE\"\r\ndate: \" 14:45:36 09 Jan,2022 \"\r\noutput: html_document\r\n---\r\nFormat Options\r\n\r\nNumeric:%H : Hour; %M : Minute; %S : Second; %Y or %y : Year; %m : Month; %d : DayText:%A or %a : Weekday; %B or %b : Month(e.g., January or Jan)\r\n\r\nAdd Table-of-Content & CSS\r\n\r\n\r\n\r\n---\r\ntitle: \"Untitled\"\r\nauthor: \"V LAKE\"\r\ndate: \" 12/17/2021 \"\r\noutput: \r\n  html_document:\r\n    toc: true\r\n    number_sections: true\r\n    toc_float: true\r\n    toc_depth: 3\r\n    css: style.css\r\n---\r\nCustomize fonts and colors\r\nCreate a text file and name it as style.css then link it in YAML header.\r\n.css file should be in the same directory as .Rmd file\r\n#TOC {\r\n  color: #B8860B;\r\n  font-family: Agency FB;\r\n  font-size: 16px;\r\n  border-color: #708090;\r\n}\r\n#header{\r\n  color:red;\r\n  opacity: 0.8;\r\n}\r\nbody{\r\n  color:green;\r\n  font-size: 10px;\r\n}\r\npre{\r\n  color:blue;\r\n  background-color: #eab676;\r\n}\r\n\r\n\r\n\r\nAdd Parameters\r\n\r\n\r\n\r\n\r\nAdd <name : value > under params: in YAML header\r\nInvoke the parameters in YAML header’s title, Text body and Code chunk.\r\n\r\n\r\n\r\n\r\nPlots\r\nFigure arguments\r\n\r\n\r\n\r\n\r\nFig Size\r\n1. fig.width= 5,fig.height =3 OR\r\n2. fig.dim = c(5,3) OR\r\n3. out.width =’ % ‘,out.height =’ %’Fig Alignment : fig.align = 'left'/'center'/'right'Fig Caption : fig.cap = 'xxx'\r\n\r\nSet Options Globally\r\nknitr::opts_chunk$set( setting, echo= TURE)\r\nsetting before echo = is the global settings\r\n\r\n\r\n\r\nKeep the Current Format\r\nIf using this piece of command inside R code chunk to insert picture,do insert a space line between the text and code chunk, otherwise it will reset the format of later text to normal body, even you tried to format it as header or index.\r\n\r\n\r\nknitr::include_graphics(\"pics/css.png\")\r\n\r\n\r\n\r\n\r\nFrankly speaking, whenever your format doesn’t work as you expected, try insert a space line between different formats.\r\n\r\nAdd Tables\r\n\r\nUse kable( dataset, args ) in r code chunk.\r\narguments include:col.names = c(\"col1\",\"col2\",\"col3\" )align = \"ccc\"caption = \" \"\r\n\r\n\r\n\r\n\r\nCode Chunk\r\nOptions\r\n\r\n\r\n\r\n\r\nCode & Output Result \r\n1. include = FALSE : show nothing, but run in background .\r\ne.g., import library, dataset / setup global options/ exclude messages\r\n2. echo = FALSE : only show result ( no code ), e.g., plotting\r\n3. eval = FALSE : only show code ( not run, no actual impact by the code )\r\n4. collapse = FALSE : combine code & result together in same area (by default, they are separated )Message,error,warning Default Value:\r\n1. warning /message = TRUE\r\n2. error = FALSE ( if encounter error, stop knitting )\r\n\r\nLoad Packages\r\n\r\n\r\n\r\nInteract with Python\r\nLet’s make it super clear: R Markdown and knitr do support Python.The Python support in R Markdown and knitr is based on the reticulate package which allows two-way communication between Python and R.\r\n\r\nunfortunately, I prefer to use them separately. However, more info can be found here.\r\n\r\nIf only for report purpose for which we only want to show the python codes in an R Markdown document, we can add chunk header like this:\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-12-17-report-with-r-markdown/pics/specificDate.png",
    "last_modified": "2022-01-09T14:45:37+08:00",
    "input_file": "report-with-r-markdown.knit.md"
  },
  {
    "path": "posts/2021-12-06-cloud-api-journey/",
    "title": " POSTMAN & Google Cloud API",
    "description": "Resources of learning API& POSTMAN from basic concepts. Steps of setting up OAuth2.0 authentication for Google cloud API on POSTMAN. How to send Google-DOC-AI processing request in POSTMAN",
    "author": [
      {
        "name": "V.LC.LAKE",
        "url": {}
      }
    ],
    "date": "2021-12-06",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nAPI Basics\r\nPOSTMAN\r\nPostman OAuth2.0 authentication to use Google API\r\nGoogle Doc AI API References\r\nSend a Google-DOC-AI Processing Request in POSTMAN\r\n\r\nAPI Basics\r\nAPIs for beginners\r\n\r\n\r\n\r\nPOSTMAN\r\nPostman Beginner’s Course - API Testing\r\n\r\n\r\nQuery Parameter\r\n\r\nQuery Parameter is used to filter what API returned, usually by pointing out the field’s value of returned json.\r\n\r\n\r\n\r\n\r\nTests tab\r\n\r\nIf we want to check/test data of the returned Body, we could filter them in the Tests tab (won’t change the returned Body, but filter in the “Tests” tab).\r\n\r\n2.1. We can use Console.log () to see the results of Tests,also can set the result of interest as a global variable for later requests.\r\n\r\n\r\n\r\n\r\nOne of the advantage of using POSTMAN console.log() is that the returned Json file can be viewed in a very clear manner, since the field and value are displayed in different colors.\r\n\r\n\r\n\r\n\r\n2.2. pm.test()\r\npm.test( “description string”, callback function-what to test ) is for postman to test the request response.\r\n\r\n\r\n\r\n2.3. jump a request\r\n\r\n\r\n\r\n2.4. stop\r\n\r\n\r\n\r\nPostman OAuth2.0 authentication to use Google API\r\n\r\nUsing POSTMAN requires different authentication from using python code which uses Service Accounts and its json key, additional setups are needed to perform:\r\n1. Register POSTMAN as Authorised redirect URIs (web applications)\r\n2. Register postman as Authorised domains\r\n3. Add scope for specific API\r\n\r\nSetup Steps :\r\nGo to Google Cloud Platform and sign in your Google account, select the Project you are in.\r\nGo to APIs & Services and then to Credentials > Create OAuth Client ID\r\nSelect Web application for Application type and enter either https://oauth.pstmn.io/v1/browser-callback or https://oauth.pstmn.io/v1/callback for Authorized redirect URLs. This ensures the auth flow works for Postman on both desktop and web. Once you hit Create you will see Client ID and Client Secret - those two values are important (do NOT share with anyone) and we will need them later in Postman.\r\nNext go to OAuth consent screen and enter oauth.pstmn.io for Authorised domains. For Scope, and for Google cloud API, https://www.googleapis.com/auth/cloud-platform\r\n\r\n\r\n\r\n5. Go to postman, and edit the collection for the project. In Authorization tab > Type, choose oAuth 2.0, the go down to Configure New Token, fill in the information and click Get New Access Token.\r\nFor “Auth URL”: https://accounts.google.com/o/oauth2/auth\r\nFor “Access Token URL”: https://accounts.google.com/o/oauth2/token\r\nFor “Scope”: https://www.googleapis.com/auth/cloud-platform Then it will open up a web browser window asking for your authentication.\r\n\r\n\r\n\r\nFinally, token will be generated , as below. Those token may expire in some period, when it comes, just repeat the step 5 to get new token.\r\n\r\n\r\n\r\nWhen making request, just choose / inherit the Available Tokens.\r\n\r\n\r\n\r\nGoogle Doc AI API References\r\nOverviewHow to GuidesReference\r\n\r\n\r\n\r\nSend a Google-DOC-AI Processing Request in POSTMAN\r\ncheck official reference\r\n\r\n\r\n\r\nHTTP method and URL:\r\nPOST \r\nhttps://LOCATION-documentai.googleapis.com/v1/projects/PROJECT_ID/locations/LOCATION/processors/PROCESSOR_ID:process \r\nBody:\r\n{\r\n  \"skipHumanReview\": true,\r\n  \"inlineDocument\": {\r\n    \"mimeType\": \"application/pdf\",\r\n    \"content\": \"{{f4}}\"\r\n  }\r\n}\r\nHuman Review means Human In The Loop processor which enables human verification and corrections to ensure accuracy of data extracted by Human in the Loop processors before it is used in critical business applications. It provides a workflow and UI for humans (referred to as labelers in HITL) to review, validate and correct the data extracted from documents by Human in the Loop processors.\r\nmimiType is talking about the file formats DOC AI supports:'application/pdf' ,'application/json', 'image/tiff', 'image/gif'.\r\nfor content we need pass base64 encoding (ASCII string) of binary image data into JSON representations. Google also has its recommended ways to do it from which my code also borrowed the core.\r\n\r\nimport base64\r\n# Pass the image data to an encoding function.\r\ndef encode_image(image):\r\n  image_content = image.read()\r\n  return base64.b64encode(image_content)\r\n\r\nf4 =\"CI0000000041.pdf\"\r\nfile_dir =\"C:/V/Google AI doc/invoice_parser/\"\r\nPDF_PATH = file_dir + f1 # Update to path of target document\r\ntext_dir = file_dir +'base64.txt'\r\n# encode\r\nwith open(PDF_PATH, \"rb\") as image:\r\n    content = encode_image(image)\r\n# get content and use it in POSTMAN\r\nwith open(text_dir,\"wb\") as f:\r\n    f.write(content)\r\n  \r\n\r\n\r\nA good way to adduce the content({{f4}}) is to save it as a global variable\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-12-06-cloud-api-journey/pics/api_basics.jpg",
    "last_modified": "2021-12-17T16:55:48+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-10-07-blockchain-and-smart-contract/",
    "title": "Blockchain and Smart Contract",
    "description": "Mabybe in one day, we can realize social covenant, not only in concept but also in execution, to reach a state of unprecedented fairness in human history.",
    "author": [
      {
        "name": "V.LC.LAKE",
        "url": {}
      }
    ],
    "date": "2021-10-07",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nBlockchain v.s. Protocol v.s. Token\r\nSmart Contract\r\nEthereum Turing Complete\r\nWhat’s special about Blockchain\r\n\r\n\r\n#TOC {\r\n  color: #A23EF4;\r\n  font-family: Agency FB;\r\n  font-size: 20px;\r\n}\r\nBlockchain v.s. Protocol v.s. Token\r\nBlockchain is a special (cryptographical blocks, chain, immutability, decentralization…) type of data structure or database implemented by a network of nodes who run on the same set of protocols (for example, Ethereum or Bitcoin or Neo etc.,). Its data entries are produced by nodes through a set of rules including consensus.\r\nOn top of those protocols, the token can be generated by a specific type of smart contract which use the blockchain to record each account’s balance and transaction records. Token can be used to pay for network fees, smart contract deployments and in dApp(decentralized application) purchases.\r\nSmart Contract\r\nSmart contract is just a jargon of blockchain, essentially, it is a piece of code, and more specifically, it resembles the class concept in python and many other programming languages. The main compositions are contract data and functions (methods to manipulate the data in the contract).\r\n\r\n\r\n\r\nOnce the contract is deployed, it is stored in a place (an address) on blockchain. And other users of this smart contract could use (call) those functions, then the data inside the contract are impacted as a result.\r\n\r\n\r\n\r\nEthereum Turing Complete\r\nFirst of all, it is talking about smart contract language Solidity for Ethereum. Solidity is Turing complete.\r\nSo, what dose it to do with Turing? Well because he designed the theoretical computer which can solve any computational problem, unlike the computing machines before him which were designed specifically for a certain problem, which means if you wanted to compute another set of mathematical problems, you need build another tailored machine. So such a computer which promises to solve any computational problem (though it doesn’t guarantee the time that will take: sooner or later) is regarded as Turing complete (TC).\r\nIf a programing language like Solidity is called TC, it means that you can solve any computational problem using this language. Practically speaking, one feature of a TC language is loop. Bitcoin script language is not TC by its designer, but Ethereum’s is, partly because Bitcoin is solely for payment while Ethereum’s designers want it to be the platform of dApps, which needs to empower its script language more.\r\nTo avoid people using loop maliciously on blockchain, Ethereum has adopted the idea of Gas to charge for each computing operation in the smart contract.\r\nWhat’s special about Blockchain\r\nFor applications (codes) running on a server, all clients (the front ends) are only sending requests then the codes are run on a central location (the server). So, the codes are stored and executed centrally.\r\nOn the other hand, blockchain technology enables codes stored and run in every node of its network (decentralized) and what’s amazing is that blockchain technology can make all those nodes work in quantum entanglement style, which means once the data on blockchain is successfully modified by one node (by Pow, Pos etc), the data stored in other nodes will be updated to reflect the change also. The result will be that the same world state (all information in blockchain at one time) is shared by all nodes in the network of this blockchain.\r\nThis kind of synchronization made by distributed nodes is achieved by the combination effects of the same set of consensus mechanism, cryptography standards as well as messaging protocols.\r\n\r\nYou can think of a picture that all nodes are surrounding a shared holy tablet ( the distributed ledger aka blockchain ) on which each entry is written after all nodes running the same script (smart contract)and agreeing on one final result (involve consensus and messaging each other). In the protection of HASH, history is created and witnessed by all and immutable once it is on the chain.\r\n\r\n\r\nFinally, if we let our imagination go wilder, we can put the law execution in smart contract to realize the idea of social covenant. What’s special about blockchain technology is that it enables the same rule applies to everyone, not only on concept but also on execution, since the terms will be automatically checked against and trigger the responsive punishment or reward` .\r\n\r\nIn this sense, blockchain will make us to reach a state of unprecedented fairness.\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-10-07-blockchain-and-smart-contract/pic/contract.png",
    "last_modified": "2021-12-18T11:51:43+08:00",
    "input_file": "blockchain-and-smart-contract.knit.md"
  },
  {
    "path": "posts/2021-09-10-from-ideas-to-execution/",
    "title": "From Ideas to Deliverable Works",
    "description": "Imagine a ship confronting a capricious ocean, who needs the ability to be adaptive-to-change? The crew members on the ship? Or The captain?  Neither. It is the ship that needs to be able to change swiftly.",
    "author": [
      {
        "name": "V.LC.LAKE",
        "url": {}
      }
    ],
    "date": "2021-09-10",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n1. A Bad Experience\r\nA few years ago, I had this exhausted experience in making changes in a small real estate development company. At the beginning as a member of senior management, the initiative to deploy new strategy for the project and company was all exciting since the plan/ vision/ ideas from board was quite appealing, not only to senior managers, but also to government and medias. Why? Because those ideas are “creative”, new technology employing, sound future-oriented and promising. But the reality is those ideas never realize.\r\nWhen it comes to internal execution and deliveries, that hot passion met with cold reaction from employees. In our eyes, most of them were unwilling to accept new ideas, slow to changes, not responsive to the use of new tools… But in their eyes (this is the retrospective view), senior managers came up with new ideas everyday and enjoyed the luxury of freeing their imagination and widening their vision.\r\nIn staffs’ eyes, top managers were good at pointing out the destination for a ship in the ocean but left the crews to figure out how to get there. However, there are infinite number of paths possible to lead to that destination and before an executable plan forms, the first reaction staffs would take usually is to wait and maintain the status quo —以不变应万变 in Chinese. In managers’ eyes, this is the signature of being slow or even reluctant to change. But what are they waiting for? For things/ tasks become clearer.\r\n1.1 Who’s to blame?\r\nI can’t blame each side. Can’t blame the top managements for having too many ideas, since that is their job and value.\r\nNeither can I blame the employees, since when they signed employment contract, they were agreed to serve specific roles with specific skills (most likely there was no itemized job requirement for being-adaptable-to-change, since no one would in advance know what is going to change in the future and what to adapt to ? )and they normally do well in completing a clearly defined task.\r\nTo V, there is a gap need to be filled. A gap between manager’s innovative (but sometimes inevitably vague) idea and an executable path/ plan for staffs to carry out professionally.\r\nTherefore, a middleware / middleman is needed, to have the talent and responsibility of drawing out the path, leaving the employees focusing on their own fields and tasks only.\r\n2. A surprisingly effortless but successful project experience\r\nDuring master program, for almost each course we took, we were asked to form a team and a problem that need to be solved, then use the skill and knowledge learnt in class to form a detailed plan even model to solve it. (Great program, thanks to Singapore Management University)\r\nThose projects were not easy though, since I didn’t know those team members before ,unaware of their mindsets and capabilities. Most of the time, I felt I was trying my best but still couldn’t get a great result/ project performance.\r\nI tried to force myself to accept the notion that teamwork won’t be easy, until I finished a data analytic project with one classmate and got it accepted by JMP Discovery Summit Americas 2021. The most unbelievable part is that that is the most comfortable and effortless project for me till now, but it achieves the best result! (easy doesn’t mean the project has no intellectual value, effortless doesn’t mean we succeeded due to luck)\r\n2.1 Why least effort but most effective?\r\nUpon completion of that project in May 2021, I couldn’t help giving gratitude to Yongkai (my teammate) since I felt that I didn’t “do” the work much (e.g.,run the model or write report) but contribute ideas and discussions along the way (e.g.,frame problem statement, discuss the approach to tackle the problem, raise questions on his analysis, read the final report and give feedback )\r\nSurprisingly, Yongkai conveyed his thanks to me for all my ideas and questions raised in the project. He said he is the kind of person good at effective execution but he needs clear directions, once he knows what to do next, he could be very efficient to deliver. He said because his energy focused on finding solutions for the problems occurring during doing, he was not good at thinking out of the box or thinking differently.\r\nAll in all, it turns out the best outcome comes not from “hard” work but from the coincidence that our thinking habits fit each other’s perfectly, the fact that we only need to contribute in what we are good at made everyone’s work effortless but fruitful.\r\n2.2 Key takeaways from this experience\r\nEveryone has his/her own way of thinking formed by his or her entire life. If possible, matching team with complementary Thinking Style, for example,\r\nConceptual ：Visionary/ Intuitive about ideas/ Enjoys the unusual/ Learns by experimenting\r\nProcedural : Likes guidelines/ Predictable/ Cautious of new ideas/ Learns by doing\r\n\r\nThere is no better or worse thinking style, since any work needs both thinking and doing. The fact that in general we are comfortable and proficient at only one style,we need appreciate each other to be able to deliver a piece of fine work..\r\n3. What about the ability to change\r\nIn a fast-pacing ever-changing business world, many believe it is paramount to have the ability to change. Again, sounds appealingly correct, but think deeply, who is the subject here?\r\nImagine a ship confronting a capricious ocean, who needs the ability to be adaptive-to-change? The crew members on the ship? Or The captain? Neither. It is the ship that needs to be able to change swiftly. Each staff on the contrary, needs specialize in their own task.\r\n\r\nThis is the power of system behavior (to put it simply, 1+1 > 2).\r\nEach water molecule in the ocean needs to perform the function no more than what a H2O molecule can do. It is the system that forms the totally disparate existence – the ocean.\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-09-10-from-ideas-to-execution/pic/oceanship.jpg",
    "last_modified": "2021-09-11T12:46:44+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "IT IS More Than Memory",
    "description": "Writing today to amaze self in the future.",
    "author": [
      {
        "name": "V.LC.LAKE",
        "url": {}
      }
    ],
    "date": "2021-09-09",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n\r\nKiki’s 1st official hand-written English. 如此美，如此美好。\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/welcome/pic/to_grace.jpg",
    "last_modified": "2021-09-10T22:43:51+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-09-steps-to-create-distill-blog/",
    "title": "Distill Blog with R Studio",
    "description": "Wrap your head around the relationships among Distill-Rmarkdown-Git-Github-Netlify. Be familiarized with the commands necessary in Rstudio to create blog and to make new posts.",
    "author": [
      {
        "name": "V.LC.LAKE",
        "url": {}
      }
    ],
    "date": "2021-09-09",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nClear Buzz-words first !\r\nDistill References\r\n\r\nGetting Started\r\nStructure of Dstill Blog in Rstudio\r\nSteps & Commands\r\nV 说\r\n\r\n\r\n#TOC {\r\n  color: #E3180D;\r\n  font-family: Agency FB;\r\n  font-size: 20px;\r\n}\r\nClear Buzz-words first !\r\nDistill is a package in R to use R Markdown to creat professional-looking blogs. It takes care of all the html-webpage’s construction, leaving us only need to focus on how to use Rmarkdown.\r\nGit is a version control application which helps to track all the modifications of the blog posts.It is quite convenient if we directly use it in Rstudio.\r\nGithub is a cloud app of Git. Commit-in-Git, then push-to-Github are the successive steps each time we make change to the blog project.\r\nNetlify is where we can share the blogs with the rest of the world. Each blog project will be assigned a site name in its own domain and most importantly it can connect with Github therefore seamlessly work with Github. Once we deploy the blog project in Netlify for the first time, each time we make changes or creat new posts, we only need proceed Commit-Push (Git-Github), Netlify will automatically detect the change and update our web pages.\r\nDistill References\r\n1 Distill for R Markdown\r\n2. Reference Guide\r\n3. distilltools\r\n4. The disdillery–customize your sites\r\n5. Personalizing the distill template\r\nGetting Started\r\ninstall Git\r\nconfigure Git in Rstudio\r\n\r\nregister Github\r\nsign up Netlify and connect with your Github\r\ninstall R packages in R Studio\r\n\r\n\r\n\r\nDistill for R Markdown\r\nusethis\r\nStructure of Dstill Blog in Rstudio\r\n\r\n\r\n\r\nAfter creating a distill blog project(VLife), the structure of the blog is automatically created, including a index.Rmd,a about.Rmd and a welcome.Rmd ,two folders(_posts, _site) as well as a yaml file(_site.yml)\r\n_posts is where we create new blog posts in Rstudio\r\n_site is where Netlify look for the html pages it needs to update\r\n\r\nSteps & Commands\r\n参考Dan心目中的大神 Prof KAM Tin Seong 教你 Building a blog with distill for R Markdown\r\nIn Rstudio, New Project> Distill Blog\r\n\r\n\r\n\r\n注意在【New Project Wizard】,put the directory(project)in subdirectory which has the same name as Github name(e.g.,CHENLAKE).\r\nEdit and Kit blog page (e.g.,index.Rmd) to see the blog html\r\nPublish\r\n3.1. Git\r\nIn console,input command usethis::use_git()\r\nIf it is the 1st time to use Git for a newly created project, select <not now> for <commit>, <yes> for <restart Rstudio>\r\nElse, in Git pane, select all the modified files then commit \r\n\r\n3.2. Github\r\nIf it is the first time to use Github for a newly created project, in console, input command usethis::use_github()\r\nElse, in Git pane, select push\r\n\r\n3.3. Netlify\r\nIt only needs to deploy once (the first time).Point the <Publish directory> to <_site>\r\n\r\n\r\n\r\n\r\nCreat new post\r\ninput console command distill::create_post(“Post name”)\r\na new folder will appear in <_posts> folder followed by Commit and Push in Git pane.\r\n\r\n\r\n\r\n\r\nV 说\r\n\r\nProf Kam is the one who keeps reminding us to record or document life.\r\nI agree.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-12-18T11:47:58+08:00",
    "input_file": "steps-to-create-distill-blog.knit.md"
  }
]
