[
  {
    "path": "posts/2021-09-10-from-ideas-to-execution/",
    "title": "From Ideas to Deliverable Works",
    "description": "Imagine a ship confronting a capricious ocean, who needs the ability to be adaptive-to-change? The crew members on the ship? Or The captain?  Neither. It is the ship that needs to be able to change swiftly.",
    "author": [
      {
        "name": "V.LC.LAKE",
        "url": {}
      }
    ],
    "date": "2021-09-10",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n1. A Bad Experience\r\nA few years ago, I had this exhausted experience in making changes in a small real estate development company. At the beginning as a member of senior management, the initiative to deploy new strategy for the project and company was all exciting since the plan/ vision/ ideas from board was quite appealing, not only to senior managers, but also to government and medias. Why? Because those ideas are “creative”, new technology employing, sound future-oriented and promising. But the reality is those ideas never realize.\r\nWhen it comes to internal execution and deliveries, that hot passion met with cold reaction from employees. In our eyes, most of them were unwilling to accept new ideas, slow to changes, not responsive to the use of new tools… But in their eyes (this is the retrospective view), senior managers came up with new ideas everyday and enjoyed the luxury of freeing their imagination and widening their vision.\r\nIn staffs’ eyes, top managers were good at pointing out the destination for a ship in the ocean but left the crews to figure out how to get there. However, there are infinite number of paths possible to lead to that destination and before an executable plan forms, the first reaction staffs would take usually is to wait and maintain the status quo —以不变应万变 in Chinese. In managers’ eyes, this is the signature of being slow or even reluctant to change. But what are they waiting for? For things/ tasks become clearer.\r\nWho’s to blame?\r\nI can’t blame each side. Can’t blame the top managements for having too many ideas, since that is their job and value.\r\nNeither can I blame the employees, since when they signed employment contract, they were agreed to serve specific roles with specific skills (most likely there was no itemized job requirement for being-adaptable-to-change, since no one would in advance know what is going to change in the future and what to adapt to ? )and they normally do well in completing a clearly defined task.\r\nTo V, there is a gap need to be filled. A gap between manager’s innovative (but sometimes inevitably vague) idea and an executable path/ plan for staffs to carry out professionally.\r\nTherefore, a middleware / middleman is needed, to have the talent and responsibility of drawing out the path, leaving the employees focusing on their own fields and tasks only.\r\nA surprisingly effortless but successful project experience\r\nDuring master program, for almost each course we took, we were asked to form a team and a problem that need to be solved, then use the skill and knowledge learnt in class to form a detailed plan even model to solve it. (Great program, thanks to Singapore Management University)\r\nThose projects were not easy though, since I didn’t know those team members before ,unaware of their mindsets and capabilities. Most of the time, I felt I was trying my best but still couldn’t get a great result/ project performance.\r\nI tried to force myself to accept the notion that teamwork won’t be easy, until I finished a data analytic project with one classmate and got it accepted by JMP Discovery Summit Americas 2021. The most unbelievable part is that that is the most comfortable and effortless project for me till now, but it achieves the best result! (easy doesn’t mean the project has no intellectual value, effortless doesn’t mean we succeeded due to luck)\r\nWhy least effort but most effective?\r\nUpon completion of that project in May 2021, I couldn’t help giving gratitude to Yongkai (my teammate) since I felt that I didn’t “do” much of the work (since I didn’t have that exhaustive feeling as in other projects thus, I assumed I didn’t do much).\r\nSurprisingly, Yongkai conveyed his thanks to me for all my ideas and questioning of the details in the project. He said he is the kind of person good at effective execution and enjoying finding tech solutions, but he needs clear directions (e.g., I came up with the problem that our project resided on),but he couldn’t naturally think out of the box or raised the question I had during the project…\r\nAll in all, it turns out the best outcome comes not from hard work but from the coincidence that our aptitudes fit each other’s perfectly, the fact that we only need to contribute in what we are good at made everyone’s life easy and effortless!\r\nKey takeaways from this experience\r\nIf possible, matching team with complementary skills.\r\nEach one has his own field that can generate expertise and passion, if we want a great piece of work to deliver, we need to know them well so that we can put them in their most suitable position.\r\nFocus is important to those who need to carry out the work unless a coarse deliverable is expected.\r\nWhat about the ability to change\r\nIn a fast-pacing ever-changing business world, many believe it is paramount to have the ability to change. Again, sounds appealingly correct, but think deeply, who is the subject here?\r\nImagine a ship confronting a capricious ocean, who needs the ability to be adaptive-to-change? The crew members on the ship? Or The captain? Neither. It is the ship that needs to be able to change swiftly. Each staff on the contrary, needs specialize in their own task.\r\n\r\nThis is the power of system behavior (to put it simply, 1+1 > 2).\r\nEach water molecule in the ocean needs to perform the function no more than what a H2O molecule can do. It is the system that forms another disparate existence – the ocean.\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-09-10-from-ideas-to-execution/pic/oceanship.jpg",
    "last_modified": "2021-09-10T22:37:10+08:00",
    "input_file": "from-ideas-to-execution.knit.md"
  },
  {
    "path": "posts/welcome/",
    "title": "IT IS More Than Memory",
    "description": "Writing today to amaze self in the future.",
    "author": [
      {
        "name": "V.LC.LAKE",
        "url": {}
      }
    ],
    "date": "2021-09-09",
    "categories": [],
    "contents": "\r\nKiki’s 1st official hand writing of English-2021\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-09T22:32:20+08:00",
    "input_file": "welcome.knit.md"
  },
  {
    "path": "posts/2021-09-09-steps-to-create-distill-blog/",
    "title": "Steps to Create Distill Blog",
    "description": "Wrap your head around the relationships among Distill-Rmarkdown-Git-Github-Netlify. Be familiarized with the commands necessary in Rstudio to create blog and to make new posts.",
    "author": [
      {
        "name": "V.LC.LAKE",
        "url": {}
      }
    ],
    "date": "2021-09-09",
    "categories": [],
    "contents": "\r\n0. Clear Buzz-words first !\r\nDistill is a package in R to use R Markdown to creat professional-looking blogs. It takes care of all the html-webpage’s construction, leaving us only need to focus on how to use Rmarkdown.\r\nGit is a version control application which helps to track all the modifications of the blog posts.It is quite convenient if we directly use it in Rstudio.\r\nGithub is a cloud app of Git. Commit-in-Git, then push-to-Github are the successive steps each time we make change to the blog project.\r\nNetlify is where we can share the blogs with the rest of the world. Each blog project will be assigned a site name in its own domain and most importantly it can connect with Github therefore seamlessly work with Github. Once we deploy the blog project in Netlify for the first time, each time we make changes or creat new posts, we only need proceed Commit-Push (Git-Github), Netlify will automatically detect the change and update our web pages.\r\n0.1 Distill References\r\n1 Distill for R Markdown\r\n2. Reference Guide\r\n3. distilltools\r\n4. The disdillery–customize your sites\r\n5. Personalizing the distill template\r\n1. Getting Started\r\ninstall Git\r\nconfigure Git in Rstudio\r\n\r\nregister Github\r\nsign up Netlify and connect with your Github\r\ninstall R packages in R Studio\r\n\r\n\r\n\r\nDistill for R Markdown\r\nusethis\r\n2. Structure of Dstill Blog in Rstudio\r\n\r\n\r\n\r\nAfter creating a distill blog project(VLife), the structure of the blog is automatically created, including 1 index,1 about and a welcome page(in *_posts/welcome/welcome.Rmd*),two folders(_posts, _site) as well as 1 yaml file(_site.yml)\r\n_posts is where we create new blog posts in Rstudio\r\n_site is where Netlify look for the html pages it needs to update\r\n\r\n3. Steps & Commands\r\n参考Dan心目中的大神 Prof KAM Tin Seong 教你 Building a blog with distill for R Markdown\r\nIn Rstudio, New Project> Distill Blog\r\n\r\n\r\n\r\n注意在【New Project Wizard】,put the directory(project)in subdirectory which has the same name as Github name(e.g.,CHENLAKE).\r\nEdit and Kit blog page (e.g.,index.Rmd) to see the blog html\r\nPublish\r\n3.1. Git\r\nIn console,input command usethis::use_git()\r\nIf it is the 1st time to use Git for a newly created project, select <not now> for <commit>, <yes> for <restart Rstudio>\r\nElse, in Git pane, select all the modified files then commit\r\n\r\n3.2. Github\r\nIf it is the first time to use Github for a newly created project, in console, input command usethis::use_github()\r\nElse, in Git pane, select push\r\n\r\n3.3. Netlify\r\nIt only needs to deploy once (the first time).Point the <Publish directory> to <_site>\r\n\r\n\r\n\r\n\r\nCreat new post\r\ninput console command distill::create_post(“steps to create distill blog”)\r\na new folder will appear in <_posts> folder followed by Commit and Push in Git pane.\r\n\r\n\r\n\r\n\r\nV 说\r\n\r\nProf Kam is the one who keeps reminding us to record or document life.\r\nI agree.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-09-09-steps-to-create-distill-blog/pic/pack.jpg",
    "last_modified": "2021-09-10T22:24:45+08:00",
    "input_file": "steps-to-create-distill-blog.knit.md"
  }
]
